//4. Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
//14 -> нет 
//46 -> нет 
//161 -> да


int Promt(string message)
{
    System.Console.Write(message);
    string strValue = Console.ReadLine() ?? "0"; //?? "0" - если ничего не ввел, то ставим 0. Вводим числа как строки т.к. это консоль
    bool isNumber = int.TryParse(strValue, out int value);
    if (isNumber)
    {
        return value;
    }
    throw new Exception("Данное число невозможно перевести в целое число");
}

int Number = Promt("Введите целое число -> ");
bool rezult = (Number % 7==0) && (Number % 23==0);

if (rezult)
{
    System.Console.WriteLine($"{Number} -> да");
}
else
{
    System.Console.WriteLine($"{Number} -> нет");
}
